In [53]:
import pandas as pd
import numpy as np

In [54]:
retail = pd.read_csv('D:\\karan data\\Data for Preprocessing\\retail_2016_2017.csv')

In [55]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [56]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 167.8 MB

In [57]:
retail['date'] = pd.to_datetime(retail['date'], errors= 'coerce')

In [58]:
retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  datetime64[ns]
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 48.3+ MB

In [59]:
retail['date'].dt.strftime('%Y-%b-%d').head()

0    2016-Jan-01
1    2016-Jan-01
2    2016-Jan-01
3    2016-Jan-01
4    2016-Jan-01
Name: date, dtype: object

In [60]:
retail.assign(date_format = retail['date'].dt.strftime('%b %d, %Y'),
              updated_date = retail['date'] + pd.DateOffset(days=5))

,id,date,store_nbr,family,sales,onpromotion,date_format,updated_date
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0,"Jan 01, 2016",2016-01-06
1,1945945,2016-01-01,1,BABY CARE,0.000,0,"Jan 01, 2016",2016-01-06
2,1945946,2016-01-01,1,BEAUTY,0.000,0,"Jan 01, 2016",2016-01-06
3,1945947,2016-01-01,1,BEVERAGES,0.000,0,"Jan 01, 2016",2016-01-06
4,1945948,2016-01-01,1,BOOKS,0.000,0,"Jan 01, 2016",2016-01-06
...,...,...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0,"Aug 15, 2017",2017-08-20
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,"Aug 15, 2017",2017-08-20
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148,"Aug 15, 2017",2017-08-20
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,"Aug 15, 2017",2017-08-20
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0,"Aug 15, 2017",2017-08-20

In [61]:
updated_date = retail['date'] + pd.DateOffset(days=5)

In [62]:
retail['sales'].isnull().sum()

0

In [63]:
# retail['sales'] = np.where(retail['sales'] == 0, np.nan, retail['sales'])

In [64]:
retail['sales'].isnull().sum()

0

In [65]:
retail.fillna(retail['sales'].mean())

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [66]:
retail['sales'].bfill()

0             0.000
1             0.000
2             0.000
3             0.000
4             0.000
             ...
1054939     438.133
1054940     154.553
1054941    2419.729
1054942     121.000
1054943      16.000
Name: sales, Length: 1054944, dtype: float64

In [67]:
retail['sales'].ffill()

0             0.000
1             0.000
2             0.000
3             0.000
4             0.000
             ...
1054939     438.133
1054940     154.553
1054941    2419.729
1054942     121.000
1054943      16.000
Name: sales, Length: 1054944, dtype: float64

In [90]:
retail_agg = retail.loc[:, ['date', 'sales']]

In [91]:
retail_agg

              date     sales
0       2016-01-01     0.000
1       2016-01-01     0.000
2       2016-01-01     0.000
3       2016-01-01     0.000
4       2016-01-01     0.000
...            ...       ...
1054939 2017-08-15   438.133
1054940 2017-08-15   154.553
1054941 2017-08-15  2419.729
1054942 2017-08-15   121.000
1054943 2017-08-15    16.000

[1054944 rows x 2 columns]

In [ ]:
# retail['sales'] = np.where(retail['sales'] == 0, np.nan, retail['sales'])

In [93]:
retail_agg['sales'] = np.where(retail_agg['sales'] == 0, np.nan, retail_agg['sales'])

In [92]:
retail_agg.set_index('date', inplace=True)

In [94]:
retail_agg

               sales
date
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
...              ...
2017-08-15   438.133
2017-08-15   154.553
2017-08-15  2419.729
2017-08-15   121.000
2017-08-15    16.000

[1054944 rows x 1 columns]

In [95]:
retail_agg.ffill()

               sales
date
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
...              ...
2017-08-15   438.133
2017-08-15   154.553
2017-08-15  2419.729
2017-08-15   121.000
2017-08-15    16.000

[1054944 rows x 1 columns]

In [96]:
retail_agg.bfill()

               sales
date
2016-01-01     4.000
2016-01-01     4.000
2016-01-01     4.000
2016-01-01     4.000
2016-01-01     4.000
...              ...
2017-08-15   438.133
2017-08-15   154.553
2017-08-15  2419.729
2017-08-15   121.000
2017-08-15    16.000

[1054944 rows x 1 columns]

In [97]:
retail_agg.fillna(retail_agg['sales'].mean()).iloc[:10,:]

                 sales
date
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773
2016-01-01  552.494773

In [98]:
retail_agg.interpolate()

               sales
date
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
2016-01-01       NaN
...              ...
2017-08-15   438.133
2017-08-15   154.553
2017-08-15  2419.729
2017-08-15   121.000
2017-08-15    16.000

[1054944 rows x 1 columns]

In [99]:
df = retail.loc[:, ['date', 'sales']].set_index('date')

In [105]:
df1 = df.groupby('date')[['sales']].sum().round(2).iloc[1:]

In [115]:
df1.assign(previous_day_sales = df1['sales'].shift(),
           Next_day = df1['sales'].shift(-1), 
           ratio = df1['sales']/df1['sales'].shift()
           )

                 sales  previous_day_sales    Next_day     ratio
date
2016-01-02  1066677.42                 NaN  1226735.72       NaN
2016-01-03  1226735.72          1066677.42   955956.88  1.150053
2016-01-04   955956.88          1226735.72   835320.44  0.779269
2016-01-05   835320.44           955956.88   821685.66  0.873806
2016-01-06   821685.66           835320.44   653504.37  0.983677
...                ...                 ...         ...       ...
2017-08-11   826373.72           651386.91   792630.54  1.268637
2017-08-12   792630.54           826373.72   865639.68  0.959167
2017-08-13   865639.68           792630.54   760922.41  1.092110
2017-08-14   760922.41           865639.68   762661.94  0.879029
2017-08-15   762661.94           760922.41         NaN  1.002286

[591 rows x 4 columns]

In [120]:
df1.assign(
    difference = df1['sales'].diff(2)
)

                 sales  difference
date
2016-01-02  1066677.42         NaN
2016-01-03  1226735.72         NaN
2016-01-04   955956.88  -110720.54
2016-01-05   835320.44  -391415.28
2016-01-06   821685.66  -134271.22
...                ...         ...
2017-08-11   826373.72    92234.05
2017-08-12   792630.54   141243.63
2017-08-13   865639.68    39265.96
2017-08-14   760922.41   -31708.13
2017-08-15   762661.94  -102977.74

[591 rows x 2 columns]

In [123]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0